{
  "name": "Plan K - Organic Paleo-Inspired Muscle Gainer",
  "meals": {
    "Breakfast": {
      "time": "07:00",
      "details": "Organic Sweet Potato Hash with Eggs: 1 large organic sweet potato (diced), 4 oz organic ground turkey, 2 organic eggs, 1/4 organic avocado, 1 tbsp organic coconut oil, 1 tsp organic herbs (rosemary, thyme)",
      "instructions": "Sauté sweet potato and turkey in coconut oil. Add eggs and cook. Serve with sliced avocado and herbs."
    },
    "Mid-Morning Snack": {
      "time": "10:00",
      "details": "Organic Bone Broth Protein Shake: 1 cup organic bone broth, 1 scoop organic collagen peptides, 1/2 organic banana, 1 tbsp organic almond butter, 1 tsp organic cinnamon",
      "instructions": "Blend all ingredients until smooth."
    },
    "Lunch": {
      "time": "13:00",
      "details": "Organic Grilled Chicken Salad: 6 oz organic grilled chicken breast, 2 cups organic mixed greens, 1/4 cup organic walnuts, 1/4 cup organic blueberries, 2 tbsp organic olive oil, 1 tbsp organic balsamic vinegar",
      "instructions": "Grill chicken. Toss greens with walnuts and blueberries. Top with chicken and dress with olive oil and balsamic."
    },
    "Pre-Workout Snack": {
      "time": "15:30",
      "details": "Organic Turkey and Vegetable Roll-Ups: 4 oz organic turkey slices, 1/4 organic cucumber (sliced), 1/4 organic bell pepper (sliced), 2 tbsp organic guacamole",
      "instructions": "Spread guacamole on turkey slices. Add cucumber and bell pepper, then roll up."
    },
    "Post-Workout Snack": {
      "time": "18:00",
      "details": "Organic Protein-Packed Smoothie: 1.5 scoops organic egg white protein powder, 1 cup organic coconut milk, 1/2 cup organic frozen strawberries, 1 tbsp organic coconut oil",
      "instructions": "Blend all ingredients until smooth."
    },
    "Dinner": {
      "time": "19:00",
      "details": "Organic Grass-Fed Steak with Vegetables: 8 oz organic grass-fed steak, 1 cup organic roasted Brussels sprouts, 1 organic baked sweet potato, 2 tbsp organic ghee",
      "instructions": "Grill steak. Roast Brussels sprouts. Bake sweet potato. Top vegetables with ghee."
    },
    "Evening Snack": {
      "time": "21:00",
      "details": "Organic Mixed Nuts and Berries: 1/4 cup organic mixed nuts (almonds, walnuts, cashews), 1/4 cup organic mixed berries",
      "instructions": "Mix nuts and berries together."
    }
  }
}